Config/ChartsOfCharacteristicTypes/АналитикаОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>АналитикаОтчетов</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ГлавыПоБюджетнойКлассификации</v8:Type>
				<v8:Type>cfg:CatalogRef.ПрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыРасходовКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементыБюджета</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыКИФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыДоходовКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЦелевыеСтатьиКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
				<v8:Type>cfg:CatalogRef.СубъектыРФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКИФ</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодвидыКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.АналитическиеКодыКПС</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодпрограммыЦелевыхСтатейКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.РазделыПодразделыКРБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиПодстатьиКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодгруппыКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
				<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиКИФ</v8:Type>
				<v8:Type>cfg:EnumRef.КВД</v8:Type>
				<v8:Type>cfg:CatalogRef.Субконто</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
				<v8:Type>cfg:CatalogRef.ГруппыПодвидовКДБ</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
				<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>20</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСубконтоОсновной</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконто</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиЗначенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСубконто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьРедактированияВПодчиненныхКонфигурациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлассификатораБК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКлассификаторовОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВладелецКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаВладелецПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Config/ChartsOfCharacteristicTypes/АналитикаОтчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если БюджетнаяОтчетностьКлиентСервер.КонфигурацияЯвляетсяПодчиненной() Тогда 
		ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	УправлениеЭлементами();
	
	Если Объект.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Субконто"))
		И НЕ ЗначениеЗаполнено(Объект.СписокЗначений) Тогда
		
	    Элементы.ГруппаДетализацияЗначений.Видимость = Истина;
		
		Если ЗначениеЗаполнено(Объект.АналитикаВладелецКод)
			И ЗначениеЗаполнено(Объект.АналитикаВладелецПубличныйИдентификатор) Тогда
			
			ДетализируемыйВидАналитики = БюджетнаяОтчетностьСервер.ПолучитьДетализируемыйКлассификаторПоКоду(Объект.АналитикаВладелецКод,Объект.АналитикаВладелецПубличныйИдентификатор);
			
			Если ЗначениеЗаполнено(ДетализируемыйВидАналитики) Тогда
				Элементы.ДекорацияПредупреждение.Видимость = Ложь;
			Иначе
				ТекстПредупреждения = Нстр("ru='Детализируемый классификатор с кодом ""%1"" и идентификатором ""%2"" отсутствует в ИБ.'");
				ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения,Объект.АналитикаВладелецКод,Объект.АналитикаВладелецПубличныйИдентификатор);
				Элементы.ДекорацияПредупреждение.Заголовок = ТекстПредупреждения;
				Элементы.ДекорацияПредупреждение.Видимость = Истина;
				
			КонецЕсли;
		Иначе
			Элементы.ДекорацияПредупреждение.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаДетализацияЗначений.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	УправлениеЭлементами();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УправлениеЭлементами()
	
	ЭтоСубконто = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Объект.ТипЗначения, Тип("СправочникСсылка.Субконто"));
	ИспользуетсяСписок = ЗначениеЗаполнено(Объект.СписокЗначений);
	
	Элементы.СписокЗначений.Видимость = ЭтоСубконто;
	
	Если Объект.ТипЗначения.Типы()[0] <> Тип("Строка") Тогда
		ЭтаФорма.Объект.ВидКлассификатораБК = "";
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПубличныйИдентификаторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить("urn:entities-1c-ru:budget/");
	ДанныеВыбора.Добавить("urn:entities-1c-ru:budget/"+СокрП(Объект.Код));
	
КонецПроцедуры
